app/Controllers/User.php

    public function koleksibuku()
    {
        $currentPage = $this->request->getVar('page_buku') ? $this->request->getVar('page_buku') : 1; // Ngambil Url Page_user
        $keyword = $this->request->getVar('keyword');
        if ($keyword) {
            $books = $this->booksModels->search($keyword);
        } else {
            $books = $this->booksModels;
        };

        $data = [
            'appName' => 'E-Perpus',
            'title' => 'Koleksi Buku',
            'sidebar' => 'Koleksi Buku',
            'buku' => $books->paginate(10, 'buku'), // Jika angka paginate ingin dirubah, ubah juga di Viewnya bagian foreach 'No'
---
SELECT *
FROM `buku`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `buku`