app/Models/booksModels.php

    public function getDataBuku($id = null)
    {
        $builder = $this->db->table($this->table . ' a');
        $builder->select('a.id, a.kode_buku, a.judul, a.pengarang, a.isbn, a.pengarang, a.jumlah_halaman, a.jumlah_stok, a.tahun_terbit, a.sinopsis, a.gambar, b.nama_kategori, c.nama_penerbit');
        $builder->join('kategori b', 'a.kategori_id = b.id');
        $builder->join('penerbit c', 'c.id = a.penerbit_id');
        if ($id != null) {
            $builder->where('a.id', $id);
        }
        $builder->orderBy('kode_buku', 'ASC');
        $query = $builder->get();
---
SELECT `a`.`id`, `a`.`kode_buku`, `a`.`judul`, `a`.`pengarang`, `a`.`isbn`, `a`.`pengarang`, `a`.`jumlah_halaman`, `a`.`jumlah_stok`, `a`.`tahun_terbit`, `a`.`sinopsis`, `a`.`gambar`, `b`.`nama_kategori`, `c`.`nama_penerbit`
FROM `buku` `a`
JOIN `kategori` `b` ON `a`.`kategori_id` = `b`.`id`
JOIN `penerbit` `c` ON `c`.`id` = `a`.`penerbit_id`
WHERE `a`.`id` = '1'
ORDER BY `kode_buku` ASC