app/Models/pinjamModels.php

SELECT `a`.`id`, `a`.`id_buku`, `a`.`no_peminjaman`, `a`.`tgl_pinjam`, `a`.`tgl_kembali`, `a`.`totalpinjam`, `a`.`status`, `a`.`tgl_pinjam`, `a`.`tgl_kembali`, `b`.`no_kartu_anggota`, `b`.`fullname`, `c`.`judul`
FROM `peminjaman` `a`
JOIN `users` `b` ON `a`.`id_user` = `b`.`id`
JOIN `buku` `c` ON `c`.`id` = `a`.`id_buku`
WHERE `b`.`id` = '12'
ORDER BY `id` ASC
---
    public function getAllPinjam($id = null)
    {
        $builder = $this->db->table($this->table . ' a');
        $builder->select('a.id, a.id_buku, a.no_peminjaman, a.tgl_pinjam, a.tgl_kembali, a.totalpinjam, a.status, a.tgl_pinjam, a.tgl_kembali, b.no_kartu_anggota, b.fullname, c.judul');
        $builder->join('users b', 'a.id_user = b.id');
        $builder->join('buku c', 'c.id = a.id_buku');
        if ($id != null) {
            $builder->where('b.id', $id);
        }
        $builder->orderBy('id', 'ASC');
        $query = $builder->get()->getResult();